Revit 2027 API
IFCFile.CreateInstance Method
 Creates an IFC instance in the file model.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle CreateInstance(
	string name
)
Public Function CreateInstance (
	name As String
) As IFCAnyHandle
public:
IFCAnyHandle^ CreateInstance(
	String^ name
)
member CreateInstance :
        name : string -> IFCAnyHandle
Parameters
name String
 The instance name.
Return Value
IFCAnyHandle
 The instance handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCFile Class
Autodesk.Revit.DB.IFC Namespace